UnsicentificLaLaLaLa/ws2812b/examples/breath_poll/device/mm32f0163d_features.h
#define TIM_CCMR2_IC3F_SHIFT                   (4)
#define TIM_CCMR2_IC3F_MASK                    (0xFU << TIM_CCMR2_IC3F_SHIFT)
#define TIM_CCMR2_IC3F(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCMR2_IC3F_SHIFT)) & TIM_CCMR2_IC3F_MASK)

#define TIM_CCMR2_IC3PSC_SHIFT                 (2)
#define TIM_CCMR2_IC3PSC_MASK                  (0x3U << TIM_CCMR2_IC3PSC_SHIFT)
#define TIM_CCMR2_IC3PSC(x)                    (((uint32_t)(((uint32_t)(x)) << TIM_CCMR2_IC3PSC_SHIFT)) & TIM_CCMR2_IC3PSC_MASK)

#define TIM_CCMR2_CC3S_SHIFT                   (0)
#define TIM_CCMR2_CC3S_MASK                    (0x3U << TIM_CCMR2_CC3S_SHIFT)
#define TIM_CCMR2_CC3S(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCMR2_CC3S_SHIFT)) & TIM_CCMR2_CC3S_MASK)

/*!
 * @brief TIM_CCER Register Bit Definition
 */

#define TIM_CCER_CC4NP_SHIFT                   (15)
#define TIM_CCER_CC4NP_MASK                    (0x01U << TIM_CCER_CC4NP_SHIFT)
#define TIM_CCER_CC4NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC4NP_SHIFT)) & TIM_CCER_CC4NP_MASK)

/* Reserved, TIM_CCER_CC4NE is invalid in F0144, just for adapting hal_tim. */
#define TIM_CCER_CC4NE_SHIFT                   (14)
#define TIM_CCER_CC4NE_MASK                    (0x01U << TIM_CCER_CC4NE_SHIFT)
#define TIM_CCER_CC4NE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC4NE_SHIFT)) & TIM_CCER_CC4NE_MASK)

#define TIM_CCER_CC4P_SHIFT                    (13)
#define TIM_CCER_CC4P_MASK                     (0x01U << TIM_CCER_CC4P_SHIFT)
#define TIM_CCER_CC4P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC4P_SHIFT)) & TIM_CCER_CC4P_MASK)

#define TIM_CCER_CC4E_SHIFT                    (12)
#define TIM_CCER_CC4E_MASK                     (0x01U << TIM_CCER_CC4E_SHIFT)
#define TIM_CCER_CC4E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC4E_SHIFT)) & TIM_CCER_CC4E_MASK)

#define TIM_CCER_CC3NP_SHIFT                   (11)
#define TIM_CCER_CC3NP_MASK                    (0x01U << TIM_CCER_CC3NP_SHIFT)
#define TIM_CCER_CC3NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC3NP_SHIFT)) & TIM_CCER_CC3NP_MASK)

#define TIM_CCER_CC3NE_SHIFT                   (10)
#define TIM_CCER_CC3NE_MASK                    (0x01U << TIM_CCER_CC3NE_SHIFT)
#define TIM_CCER_CC3NE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC3NE_SHIFT)) & TIM_CCER_CC3NE_MASK)

#define TIM_CCER_CC3P_SHIFT                    (9)
#define TIM_CCER_CC3P_MASK                     (0x01U << TIM_CCER_CC3P_SHIFT)
#define TIM_CCER_CC3P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC3P_SHIFT)) & TIM_CCER_CC3P_MASK)

#define TIM_CCER_CC3E_SHIFT                    (8)
#define TIM_CCER_CC3E_MASK                     (0x01U << TIM_CCER_CC3E_SHIFT)
#define TIM_CCER_CC3E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC3E_SHIFT)) & TIM_CCER_CC3E_MASK)

#define TIM_CCER_CC2NP_SHIFT                   (7)
#define TIM_CCER_CC2NP_MASK                    (0x01U << TIM_CCER_CC2NP_SHIFT)
#define TIM_CCER_CC2NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC2NP_SHIFT)) & TIM_CCER_CC2NP_MASK)

#define TIM_CCER_CC2NE_SHIFT                   (6)
#define TIM_CCER_CC2NE_MASK                    (0x01U << TIM_CCER_CC2NE_SHIFT)
#define TIM_CCER_CC2NE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC2NE_SHIFT)) & TIM_CCER_CC2NE_MASK)

#define TIM_CCER_CC2P_SHIFT                    (5)
#define TIM_CCER_CC2P_MASK                     (0x01U << TIM_CCER_CC2P_SHIFT)
#define TIM_CCER_CC2P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC2P_SHIFT)) & TIM_CCER_CC2P_MASK)

#define TIM_CCER_CC2E_SHIFT                    (4)
#define TIM_CCER_CC2E_MASK                     (0x01U << TIM_CCER_CC2E_SHIFT)
#define TIM_CCER_CC2E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC2E_SHIFT)) & TIM_CCER_CC2E_MASK)

#define TIM_CCER_CC1NP_SHIFT                   (3)
#define TIM_CCER_CC1NP_MASK                    (0x01U << TIM_CCER_CC1NP_SHIFT)
#define TIM_CCER_CC1NP(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1NP_SHIFT)) & TIM_CCER_CC1NP_MASK)

#define TIM_CCER_CC1NE_SHIFT                   (2)
#define TIM_CCER_CC1NE_MASK                    (0x01U << TIM_CCER_CC1NE_SHIFT)
#define TIM_CCER_CC1NE(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1NE_SHIFT)) & TIM_CCER_CC1NE_MASK)

#define TIM_CCER_CC1P_SHIFT                    (1)
#define TIM_CCER_CC1P_MASK                     (0x01U << TIM_CCER_CC1P_SHIFT)
#define TIM_CCER_CC1P(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1P_SHIFT)) & TIM_CCER_CC1P_MASK)

#define TIM_CCER_CC1E_SHIFT                    (0)
#define TIM_CCER_CC1E_MASK                     (0x01U << TIM_CCER_CC1E_SHIFT)
#define TIM_CCER_CC1E(x)                       (((uint32_t)(((uint32_t)(x)) << TIM_CCER_CC1E_SHIFT)) & TIM_CCER_CC1E_MASK)

/*!
 * @brief TIM_CNT Register Bit Definition
 */

#define TIM_CNT_CNT_SHIFT                      (0)
#define TIM_CNT_CNT_MASK                       (0xFFFFU << TIM_CNT_CNT_SHIFT)
#define TIM_CNT_CNT(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_CNT_CNT_SHIFT)) & TIM_CNT_CNT_MASK)

/*!
 * @brief TIM_PSC Register Bit Definition
 */

#define TIM_PSC_PSC_SHIFT                      (0)
#define TIM_PSC_PSC_MASK                       (0xFFFFU << TIM_PSC_PSC_SHIFT)
#define TIM_PSC_PSC(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_PSC_PSC_SHIFT)) & TIM_PSC_PSC_MASK)

/*!
 * @brief TIM_ARR Register Bit Definition
 */

#define TIM_ARR_ARR_SHIFT                      (0)
#define TIM_ARR_ARR_MASK                       (0xFFFFU << TIM_ARR_ARR_SHIFT)
#define TIM_ARR_ARR(x)                         (((uint32_t)(((uint32_t)(x)) << TIM_ARR_ARR_SHIFT)) & TIM_ARR_ARR_MASK)

/*!
 * @brief TIM_RCR Register Bit Definition
 */

#define TIM_RCR_REPCNT_SHIFT                   (8)
#define TIM_RCR_REPCNT_MASK                    (0xFFU << TIM_RCR_REPCNT_SHIFT)
#define TIM_RCR_REPCNT(x)                      (((uint32_t)(((uint32_t)(x)) << TIM_RCR_REPCNT_SHIFT)) & TIM_RCR_REPCNT_MASK)

